Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: Syntax and highlighting: *syntax-functions* *highlighting-functions* clearmatches() clear all matches defined by |matchadd()| and the |:match| commands getmatches() get all matches defined by |matchadd()| and the |:match| commands hlexists() check if a highlight group exists hlID() get ID of a highlight group synID() get syntax ID at a specific position synIDattr() get a specific attribute of a syntax ID synIDtrans() get translated syntax ID diff_hlID() get highlight ID for diff mode at a position matchadd() define a pattern to highlight (a "match") matcharg() get info about |:match| arguments matchdelete() delete a match defined by |matchadd()| or a |:match| command setmatches() restore a list of matches saved by |getmatches()|
es_es: Sintaxis y resaltado: *syntax-functions* *highlighting-functions* clearmatches() elimina las coincidencias definidas por |matchadd()| y las órdenes |:match| getmatches() obtiene todas las coincidencias definidas por |matchadd()| y las órdenes |:match| hlexists() comprueba la existencia de un grupo de resaltado hlID() obtiene el ID de un grupo de resaltado synID() obtiene el ID de sintaxis en una posición específica synIDattr() obtiene un atributo específico correspondiente a un ID de sintaxis synIDtrans() obtiene un ID de sintaxis traducido diff_hlID() obtiene el ID de resaltado para el modo diff en una posición dada matchadd() define un patrón a resaltar (una «coincidencia») matcharg() obtiene información acerca de los argumentos para |:match| matchdelete() borra una coincidencia definida por |matchadd()| o una orden |:match| setmatches() restaura una lista de coincidencias guardada por |getmatches()|

source: Spelling: *spell-functions* spellbadword() locate badly spelled word at or after cursor spellsuggest() return suggested spelling corrections soundfold() return the sound-a-like equivalent of a word
es_es: Corrección ortográfica: *spell-functions* spellbadword() ubica palabras mal escritas a partir de la posición actual del cursor spellsuggest() devuelve las correcciones ortográficas sugeridas soundfold() retorna el homófono de una palabra

source: History: *history-functions* histadd() add an item to a history histdel() delete an item from a history histget() get an item from a history histnr() get highest index of a history list
es_es: Historia: *history-functions* histadd() añade un elemento a la historia histdel() elimina un elemento a la historia histget() obtiene un elemento a la historia histnr() obtiene el índice más grande de la lista de una historia

source: Interactive: *interactive-functions* browse() put up a file requester browsedir() put up a directory requester confirm() let the user make a choice getchar() get a character from the user getcharmod() get modifiers for the last typed character feedkeys() put characters in the typeahead queue input() get a line from the user inputlist() let the user pick an entry from a list inputsecret() get a line from the user without showing it inputdialog() get a line from the user in a dialog inputsave() save and clear typeahead inputrestore() restore typeahead
es_es: Interacción: *interactive-functions* browse() despliega un diálogo de selección de archivos browsedir() despliega un diálogo de selección de directorios confirm() solicita al usuario hacer una elección getchar() solicita un carácter al usuario getcharmod() obtiene los modificadores usados en el último carácter digitado feedkeys() inserta caracteres en la cola de inserción input() solicita una línea de texto al usuario inputlist() permite al usuario elegir un elemento de una lista inputsecret() solicita una línea de texto al usuario, sin mostrarla inputdialog() solicita una línea de texto al usuario usando un diálogo inputsave() guarda y limpia el búfer de cola de inserción inputrestore() restaura el búfer de la línea de inserción

source: GUI: *gui-functions* getfontname() get name of current font being used getwinposx() X position of the GUI Vim window getwinposy() Y position of the GUI Vim window
es_es: Interfaz gráfica: *gui-functions* getfontname() obtiene el nombre del tipo de letra actual getwinposx() posición X de la ventana gráfica de Vim getwinposy() posición Y de la ventana gráfica de Vim

source: Vim server: *server-functions* serverlist() return the list of server names remote_send() send command characters to a Vim server remote_expr() evaluate an expression in a Vim server server2client() send a reply to a client of a Vim server remote_peek() check if there is a reply from a Vim server remote_read() read a reply from a Vim server foreground() move the Vim window to the foreground remote_foreground() move the Vim server window to the foreground
es_es: Servidor Vim: *server-functions* serverlist() devuelve una lista con nombres de servidores remote_send() envía órdenes (caracteres) a un servidor Vim remote_expr() evalúa una expresión en un servidor Vim server2client() envía una respuesta a un cliente de un servidor Vim remote_peek() comprueba si hay respuestas de un servidor Vim remote_read() lee una respuesta de un servidor Vim foreground() desplaza la ventana de Vim a primer plano remote_foreground() desplaza la ventana de un servidor Vim a primer plano

source: Window size and position: *window-size-functions* winheight() get height of a specific window winwidth() get width of a specific window winrestcmd() return command to restore window sizes winsaveview() get view of current window winrestview() restore saved view of current window
es_es: Tamaño y posición de ventanas: *window-size-functions* winheight() obtiene la altura de una ventana específica winwidth() obtiene el ancho de una ventana específica winrestcmd() devuelve una orden para restaurar los tamaños de ventana winsaveview() obtiene una vista de la ventana actual winrestview() devuelve una vista almacenada en la ventana actual

source: Various: *various-functions* mode() get current editing mode visualmode() last visual mode used hasmapto() check if a mapping exists mapcheck() check if a matching mapping exists maparg() get rhs of a mapping exists() check if a variable, function, etc. exists has() check if a feature is supported in Vim changenr() return number of most recent change cscope_connection() check if a cscope connection exists did_filetype() check if a FileType autocommand was used eventhandler() check if invoked by an event handler getpid() get process ID of Vim
es_es: Varios: *various-functions* mode() obtiene el modo de edición actual visualmode() último modo visual usado hasmapto() comprueba la existencia de una macro mapcheck() comprueba la existencia de una macro que coincida con el argumento dado maparg() obtiene el rhs de una macro exists() comprueba si la variable, función, etc., existe has() comprueba si Vim cuenta con la característica dada changenr() devuelve el número correspondiente al cambio más reciente cscope_connection() comprueba si hay una conexión a cscope did_filetype() comprueba si se ha usado una orden automática FileType eventhandler() comprueba si se ha sido invocado desde un manejador de eventos getpid() obtiene el ID de proceso de Vim

source: libcall() call a function in an external library libcallnr() idem, returning a number
es_es: libcall() llama a una función en una biblioteca externa libcallnr() idéntica, pero devuelve un número en vez de una cadena

source: getreg() get contents of a register getregtype() get type of a register setreg() set contents and type of a register
es_es: getreg() obtiene el contenido de un registro getregtype() obtiene el tipo de un registro setreg() asigna el tipo y contenido de un registro

source: taglist() get list of matching tags tagfiles() get a list of tags files
es_es: taglist() obtiene una lista de etiquetas coincidentes tagfiles() obtiene una lista de archivos de etiquetas

source: mzeval() evaluate |MzScheme| expression
es_es: mzeval() evalúa una expresión |MzScheme|

source: *41.7* Defining a function
es_es: *41.7* Definición de funciones

source: Vim enables you to define your own functions. The basic function declaration begins as follows: >
es_es: Vim permite definir nuevas funciones. La definición básica de una función corresponde a lo siguiente: >

source: :function {name}({var1}, {var2}, ...) : {body} :endfunction < Note: Function names must begin with a capital letter.
es_es: :function {nombre}({var1}, {var2}, ...) : {instrucciones} :endfunction < Nota: Los nombres de funciones deben empezar con una letra mayúscula.

source: Let's define a short function to return the smaller of two numbers. It starts with this line: >
es_es: Vamos a definir una función pequeña que retorne el más pequeño de dos números. Su definición empieza con esta línea: >

source: This tells Vim that the function is named "Min" and it takes two arguments: "num1" and "num2". The first thing you need to do is to check to see which number is smaller: > : if a:num1 < a:num2
es_es: Ésta le indica a Vim que la función se llama «Min» y que recibe dos argumentos: «num1» y «num2». El primer paso es comprobar qué número es el más pequeño: > : if a:num1 < a:num2

source: The special prefix "a:" tells Vim that the variable is a function argument. Let's assign the variable "smaller" the value of the smallest number: >
es_es: El prefijo especial «a:» le indica a Vim que la variable es un argumento de la función. Asignemos ahora a la variable «menor» el valor del menor número: >

source: : if a:num1 < a:num2 : let smaller = a:num1 : else : let smaller = a:num2 : endif
es_es: : if a:num1 < a:num2 : let menor = a:num1 : else : let menor = a:num2 : endif

source: The variable "smaller" is a local variable. Variables used inside a function are local unless prefixed by something like "g:", "a:", or "s:".
es_es: La variable «menor» es una variable local. Las variables usadas dentro de una función son locales a menos que tengan un prefijo como «g:», «a:», o «s:».

source: Note: To access a global variable from inside a function you must prepend "g:" to it. Thus "g:today" inside a function is used for the global variable "today", and "today" is another variable, local to the function.
es_es: Nota: Para usar una variable global dentro de una función debe anteponer «g:» a su nombre. Dentro de una función, «g:hoy» corresponde a la variable global «hoy», y «hoy» es otra variable, local respecto a la función.

source: You now use the ":return" statement to return the smallest number to the user. Finally, you end the function: >
es_es: Ahora usamos la instrucción «:return» para devolver el menor de los dos números al usuario. Finalmente, terminamos la función: >

source: : return smaller :endfunction
es_es: : return menor :endfunction

source: :function Min(num1, num2) : if a:num1 < a:num2 : let smaller = a:num1 : else : let smaller = a:num2 : endif : return smaller :endfunction
es_es: :function Min(num1, num2) : if a:num1 < a:num2 : let menor = a:num1 : else : let menor = a:num2 : endif : return menor :endfunction

source: A user defined function is called in exactly the same way as a built-in function. Only the name is different. The Min function can be used like this: >
es_es: Las funciones definidas por el usuario se invocan exactamente de la misma forma que las funciones internas. La única diferencia es el nombre. Puede usar la función Min como sigue: >

source: Only now will the function be executed and the lines be interpreted by Vim. If there are mistakes, like using an undefined variable or function, you will now get an error message. When defining the function these errors are not detected.
es_es: Sólo en este momento se ejecutará la función y Vim interpretará las instrucciones que la componen. Si hay errores, como usar una variable o función no definida, se mostrará un mensaje de error. Al definir una función estos errores no son detectados.

source: The ":call" command can be given a line range. This can have one of two meanings. When a function has been defined with the "range" keyword, it will take care of the line range itself. The function will be passed the variables "a:firstline" and "a:lastline". These will have the line numbers from the range the function was called with. Example: >
es_es: La orden «:call» puede recibir un rango de líneas. Este rango puede tener dos significados. Cuando la definición de una función tiene la palabra clave «range», ésta se hará cargo del rango de líneas. La función recibirá las variables «a:firstline» y «a:lastline». Éstas contendrán los números de línea del rango con el cual se invoca la función. Ejemplo: >

source: :function Count_words() range : let lnum = a:firstline : let n = 0 : while lnum <= a:lastline : let n = n + len(split(getline(lnum))) : let lnum = lnum + 1 : endwhile : echo "found " . n . " words" :endfunction
es_es: :function Contar_palabras() range : let lnum = a:firstline : let n = 0 : while lnum <= a:lastline : let n = n + len(split(getline(lnum))) : let lnum = lnum + 1 : endwhile : echo "encontradas " . n . " palabras" :endfunction

source: :10,30call Count_words()
es_es: :10,30call Contar_palabras()

source: It will be executed once and echo the number of words. The other way to use a line range is by defining a function without the "range" keyword. The function will be called once for every line in the range, with the cursor in that line. Example: >
es_es: La función se ejecutará una vez, y mostrará en la pantalla el número de palabras. La otra forma de usar un rango de líneas es definiendo una función sin la palabra clave «range». Se invocará la función una vez por cada línea en el rango, y el cursor estará en la línea correspondiente a cada invocación. Ejemplo: >

source: :function Number() : echo "line " . line(".") . " contains: " . getline(".") :endfunction
es_es: :function Numero() : echo "la línea " . line(".") . " contiene: " . getline(".") :endfunction

source: :10,15call Number()
es_es: :10,15call Numero()

source: Vim enables you to define functions that have a variable number of arguments. The following command, for instance, defines a function that must have 1 argument (start) and can have up to 20 additional arguments: >
es_es: Vim permite la definición de funciones que reciben una cantidad variable de argumentos. Por ejemplo, la siguiente orden define una función que debe recibir un argumento (inicio) y puede recibir hasta 20 argumentos adicionales: >

source: :function Show(start, ...)
es_es: :function Mostrar(inicio, ...)

source: The variable "a:1" contains the first optional argument, "a:2" the second, and so on. The variable "a:0" contains the number of extra arguments. For example: >
es_es: La variable «a:1» contiene el primer argumento opcional, «a:2» contiene el segundo, y así sucesivamente. La variable «a:0» contiene la cantidad de argumentos adicionales. Por ejemplo: >

source: :function Show(start, ...) : echohl Title : echo "Show is " . a:start : echohl None : let index = 1 : while index <= a:0 : echo " Arg " . index . " is " . a:{index} : let index = index + 1 : endwhile : echo "" :endfunction
es_es: :function Mostrar(inicio, ...) : echohl Title : echo "inicio es " . a:inicio : echohl None : let indice = 1 : while indice <= a:0 : echo " Arg " . indice . " is " . a:{indice} : let indice = indice + 1 : endwhile : echo "" :endfunction

source: This uses the ":echohl" command to specify the highlighting used for the following ":echo" command. ":echohl None" stops it again. The ":echon" command works like ":echo", but doesn't output a line break.
es_es: Aquí se usa la orden «:echohl», que especifica el resaltado a usar en la siguiente orden «:echo». «:echohl None» hace que no se use resaltado alguno. La orden «:echon» es similar a «:echo» pero no imprime el cambio de línea final.

source: :function < function Show(start, ...) ~ function GetVimIndent() ~ function SetSyn(name) ~
es_es: :function < function Mostrar(inicio, ...) ~ function ObtenerSangradoVim() ~ function DefinirSintaxis(nombre) ~

source: :function SetSyn < 1 if &syntax == '' ~ 2 let &syntax = a:name ~ 3 endif ~ endfunction ~
es_es: :function DefinirSintaxis < 1 if &syntax == '' ~ 2 let &syntax = a:nombre ~ 3 endif ~ endfunction ~

source: The line number is useful for when you get an error message or when debugging. See |debug-scripts| about debugging mode. You can also set the 'verbose' option to 12 or higher to see all function calls. Set it to 15 or higher to see every executed line.
es_es: El número de línea de una instrucción es información útil cuando aparece un mensaje de error o al depurar scripts. Acerca del modo de depurado, consulte |debug-scripts|. Puede darle un valor de 12 o más a la opción 'verbose' para ver todas las invocaciones a funciones. Con un valor de 15 o más verá cada línea ejecutada.

source: :delfunction Show
es_es: :delfunction Mostrar

source: Sometimes it can be useful to have a variable point to one function or another. You can do it with the function() function. It turns the name of a function into a reference: >
es_es: En ocasiones es útil que una variable pueda hacer referencia a una u otra función . Puede hacerlo usando la función function(). Ésta función convierte el nombre de una función en una referencia a la misma: >

source: :let result = 0 " or 1 :function! Right() : return 'Right!' :endfunc :function! Wrong() : return 'Wrong!' :endfunc : :if result == 1 : let Afunc = function('Right') :else : let Afunc = function('Wrong') :endif :echo call(Afunc, []) < Wrong! ~
es_es: :let resultado = 0 " o 1 :function! Bien() : return '¡Bien!' :endfunc :function! Mal() : return '¡Mal!' :endfunc : :if resultado == 1 : let Unafunc = function('Bien') :else : let Unafunc = function('Mal') :endif :echo call(Unafunc, []) < ¡Mal! ~

source: Note that the name of a variable that holds a function reference must start with a capital. Otherwise it could be confused with the name of a builtin function. The way to invoke a function that a variable refers to is with the call() function. Its first argument is the function reference, the second argument is a List with arguments.
es_es: Tenga en cuenta que el nombre de la variable que contiene la referencia a la función debe empezar con una letra mayúscula. En caso contrario, es posible que se confunda con el nombre de una de las funciones integradas de Vim. Para invocar una función usando una variable con una referencia a función se usa la función call(). Como primer argumento recibe la referencia a la función, y como segundo argumento una Lista con los argumentos para la función a invocar.

source: *41.8* Lists and Dictionaries
es_es: *41.8* Listas y Diccionarios

source: So far we have used the basic types String and Number. Vim also supports two composite types: List and Dictionary.
es_es: Hasta ahora hemos usado los tipos básicos, Cadena de texto y Número. Vim también ofrece otros dos: Lista y Diccionario.

source: A List is an ordered sequence of things. The things can be any kind of value, thus you can make a List of numbers, a List of Lists and even a List of mixed items. To create a List with three strings: >
es_es: Una Lista es una secuencia ordenada de elementos. Los elementos pueden ser de cualquier tipo, así que puede crear una Lista de números, una Lista de Listas e incluso una Lista de elementos de tipos diferentes. Para crear una Lista con tres cadenas de texto: >

source: :let alist = ['aap', 'mies', 'noot']
es_es: :let lista = ['aap', 'mies', 'noot']

source: The List items are enclosed in square brackets and separated by commas. To create an empty List: >
es_es: Los elementos de la Lista se rodean con corchetes y se separan con comas. Para crear una Lista vacía: >

source: :let alist = []
es_es: :let lista = []

source: :let alist = [] :call add(alist, 'foo') :call add(alist, 'bar') :echo alist < ['foo', 'bar'] ~
es_es: :let lista = [] :call add(lista, 'foo') :call add(lista, 'bar') :echo lista < ['foo', 'bar'] ~

source: :echo alist + ['foo', 'bar'] < ['foo', 'bar', 'foo', 'bar'] ~
es_es: :echo lista + ['foo', 'bar'] < ['foo', 'bar', 'foo', 'bar'] ~

source: :let alist = ['one'] :call extend(alist, ['two', 'three']) :echo alist < ['one', 'two', 'three'] ~
es_es: :let lista = ['uno'] :call extend(lista, ['dos', 'tres']) :echo lista < ['uno', 'dos', 'tres'] ~

source: :let alist = ['one'] :call add(alist, ['two', 'three']) :echo alist < ['one', ['two', 'three']] ~
es_es: :let lista = ['uno'] :call add(lista, ['dos', 'tres']) :echo lista < ['uno', ['dos', 'tres']] ~

source: :let alist = ['one', 'two', 'three'] :for n in alist : echo n :endfor < one ~ two ~ three ~
es_es: :let lista = ['uno', 'dos', 'tres'] :for n in lista : echo n :endfor < uno ~ dos ~ tres ~

source: This will loop over each element in List "alist", assigning the value to variable "n". The generic form of a for loop is: >
es_es: El código mostrado iterará sobre cada elemento en la Lista «lista», asignando el valor del elemento a la variable «n». La forma genérica de un ciclo «for» es: >

source: :for {varname} in {listexpression} : {commands} :endfor
es_es: :for {nombrevar} in {expresiónlista} : {instrucciones} :endfor

source: To loop a certain number of times you need a List of a specific length. The range() function creates one for you: >
es_es: Para iterar una cantidad determinada de veces necesita una Lista con una longitud específica. La función range() puede crearla por usted: >

source: Notice that the first item of the List that range() produces is zero, thus the last item is one less than the length of the list. You can also specify the maximum value, the stride and even go backwards: >
es_es: Observe que el primer elemento de la Lista creada por range() es cero, y por tanto el último elemento tiene un valor de uno menos que la longitud de la lista. También puede especificar el valor máximo, y el incremento o decremento deseado: >

source: :for line in getline(1, 20) : if line =~ "Date: " : echo matchstr(line, 'Date: \zs.*') : endif :endfor
es_es: :for line in getline(1, 20) : if line =~ "Fecha: " : echo matchstr(line, 'Fecha: \zs.*') : endif :endfor

source: A Dictionary stores key-value pairs. You can quickly lookup a value if you know the key. A Dictionary is created with curly braces: >
es_es: Un Diccionario almacena pares clave-valor. Esto le permite obtener un valor almacenado de manera rápida, si conoce la clave del mismo. Los Diccionarios se crean usando llaves: >

source: :let uk2nl = {'one': 'een', 'two': 'twee', 'three': 'drie'}
es_es: :let es2nl = {'uno': 'een', 'dos': 'twee', 'tres': 'drie'}

source: :echo uk2nl['two'] < twee ~
es_es: :echo es2nl['dos'] < twee ~

source: The possibilities with Dictionaries are numerous. There are various functions for them as well. For example, you can obtain a list of the keys and loop over them: >
es_es: Los Diccionarios ofrecen numerosas posibilidades. También dispone de varias funciones para operar sobre ellos. Por ejemplo, puede obtener una lista de las claves e iterar sobre ellas: >

source: :for key in keys(uk2nl) : echo key :endfor < three ~ one ~ two ~
es_es: :for clave in keys(es2nl) : echo clave :endfor < tres ~ uno ~ dos ~

source: You will notice the keys are not ordered. You can sort the list to get a specific order: >
es_es: Habrá notado que las claves no están ordenadas. Puede ordenar la lista para obtener un orden específico: >

source: :for key in sort(keys(uk2nl)) : echo key :endfor < one ~ three ~ two ~
es_es: :for clave in sort(keys(es2nl)) : echo clave :endfor < dos ~ tres ~ uno ~

source: But you can never get back the order in which items are defined. For that you need to use a List, it stores items in an ordered sequence.
es_es: No es posible recuperar el orden en el cual se definieron los elementos del Diccionario. Para eso necesita una Lista, que almacena los elementos en una secuencia ordenada.
